{
  "HomePage": {
    "welcome": "Welcome to",
    "projectName": "ArmenianCoin",
    "slogan": "\"With heart, soul and by the law\"",
    "description": "Uniting Armenians worldwide through cryptocurrency. Supporting children and families from Artsakh and those in need. 10% of all funds go directly to verified charity support.",
    "buyNow": "Buy ARMT Now",
    "learnMore": "Learn More",
    "symbol": "Symbol",
    "totalSupply": "Total Supply",
    "erc20": "ERC-20",
    "ethereum": "Ethereum",
    "toCharity": "To Charity",
    "missionTitle": "Our Sacred Mission",
    "missionDescription": "Supporting children and families from Artsakh and those in need across Armenia through transparent, verified charitable giving powered by blockchain technology.",
    "globalFamily": "Every person around the ArmenianCoin represents our global family united by compassion. Together, we transcend borders to provide direct support to those who need it most - children and families from Artsakh and throughout Armenia.",
    "charityHighlight": "10% of all funds go directly to verified charity support",
    "charitySubtitle": "Transparent • Verified • Impactful",
    "valuesTitle": "Built on Armenian Values",
    "valuesDescription": "Our foundation rests on the pillars of Armenian heritage: family unity, community support, and unwavering commitment to helping those in need.",
    "heartSoul": "Heart & Soul",
    "heartSoulDesc": "Every action we take comes from the heart. Supporting Artsakh families and Armenian children with genuine compassion and unwavering dedication to their wellbeing.",
    "globalUnity": "Global Unity",
    "globalUnityDesc": "Connecting Armenians worldwide through shared purpose. Our diaspora's strength lies in unity, working together to support our homeland and preserve our heritage.",
    "byLaw": "By the Law",
    "byLawDesc": "Operating with complete transparency and legal compliance. Every charitable contribution is verified, tracked, and reported to ensure maximum impact and trust.",
    "featuresTitle": "ARMT Token Features",
    "featuresDescription": "ArmenianCoin (ARMT) is more than cryptocurrency—it's a bridge connecting our global diaspora to Armenia while directly funding humanitarian support for those in need.",
    "feature1Title": "Ethereum ERC-20 Standard",
    "feature1Desc": "Secure, reliable blockchain infrastructure with global accessibility",
    "feature2Title": "1 Billion Total Supply",
    "feature2Desc": "Fixed supply ensuring scarcity and potential value appreciation",
    "feature3Title": "10% Charity Allocation",
    "feature3Desc": "Direct support for Artsakh families and Armenian children in need",
    "feature4Title": "Transparent Reporting",
    "feature4Desc": "Full visibility into charitable fund allocation and impact",
    "growthPotential": "Growth Potential",
    "growthPotentialDesc": "Built for sustainable value with charitable impact",
    "easyToHold": "Easy to Hold",
    "easyToHoldDesc": "Simple MetaMask and wallet integration",
    "communityDriven": "Community Driven",
    "communityDrivenDesc": "Decisions made by our global Armenian family",
    "verifiedImpact": "Verified Impact",
    "verifiedImpactDesc": "Transparent charity reporting and verification",
    "joinMission": "Join Our Mission Today",
    "joinMissionDesc": "Be part of something greater. Every ARMT token you hold contributes to supporting Armenian children and families in need. Together, we can make a real difference.",
    "viewCharityReports": "View Charity Reports"
  },
  "AboutPage": {
    "title": "About ArmenianCoin",
    "subtitle": "\"With heart, soul and by the law\"",
    "description": "ArmenianCoin represents more than cryptocurrency—it's a movement uniting Armenians worldwide to support children and families from Artsakh and those in need throughout Armenia.",
    "missionTitle": "Our Sacred Mission",
    "missionSubtitle": "Supporting Armenian Children & Families",
    "missionDescription": "10% of all funds go directly to verified charity support for those in need",
    "whyTitle": "Why ArmenianCoin Exists",
    "why1": "The Armenian diaspora spans the globe, but our hearts remain connected to our homeland. ArmenianCoin bridges this distance, creating a direct pathway for Armenians worldwide to support families and children in Armenia, especially those from Artsakh who face ongoing challenges.",
    "why2": "Through blockchain technology, we ensure every contribution is transparent, verified, and reaches those who need it most. This isn't just about cryptocurrency—it's about preserving our values of family, community, and helping those in need.",
    "why3": "Our slogan \"With heart, soul and by the law\" reflects our commitment to operating with genuine compassion while maintaining complete legal compliance and transparency.",
    "coreValuesTitle": "Our Core Values",
    "coreValuesSubtitle": "Built on the foundation of Armenian heritage and guided by principles that have sustained our people through centuries.",
    "heartSoulTitle": "Heart & Soul",
    "heartSoulDesc": "Every action we take comes from genuine compassion. We support Artsakh families and Armenian children with unwavering dedication, treating each contribution as a sacred trust from our global community.",
    "globalUnityTitle": "Global Unity",
    "globalUnityDesc": "Our diaspora's strength lies in unity. Armenians from Los Angeles to Paris, from Buenos Aires to Sydney, all connected by shared purpose and cultural pride, working together to support our homeland.",
    "byLawTitle": "By the Law",
    "byLawDesc": "Complete transparency and legal compliance guide everything we do. Every charitable contribution is verified, tracked, and reported, ensuring maximum impact and maintaining the trust our community places in us.",
    "howItWorksTitle": "How ArmenianCoin Works",
    "howItWorksSubtitle": "A transparent, blockchain-powered system that connects global Armenian support directly to families and children in need.",
    "step1Title": "1. Purchase ARMT",
    "step1Desc": "Buy ArmenianCoin tokens through our secure platform using MetaMask or other Ethereum wallets.",
    "step2Title": "2. Automatic Allocation",
    "step2Desc": "10% of all funds are automatically allocated to our verified charity support program.",
    "step3Title": "3. Direct Support",
    "step3Desc": "Funds go directly to verified families and children from Artsakh and throughout Armenia.",
    "step4Title": "4. Transparent Reporting",
    "step4Desc": "View detailed reports on how funds are used and the impact made in our community.",
    "commitmentTitle": "Our Commitment",
    "commitmentSubtitle": "We pledge to operate with the highest standards of integrity, transparency, and compassion.",
    "transparencyPromiseTitle": "Transparency Promise"
  }
}